demo/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.worldview.globaldata.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:validate>
         <!--Optional:-->
         <input>
            <!--Optional:-->
            <address>
               <!--Optional:-->
               <addressLine1>?</addressLine1>
               <!--Optional:-->
               <addressLine10>?</addressLine10>
               <!--Optional:-->
               <addressLine2>?</addressLine2>
               <!--Optional:-->
               <addressLine3>?</addressLine3>
               <!--Optional:-->
               <addressLine4>?</addressLine4>
               <!--Optional:-->
               <addressLine5>?</addressLine5>
               <!--Optional:-->
               <addressLine6>?</addressLine6>
               <!--Optional:-->
               <addressLine7>?</addressLine7>
               <!--Optional:-->
               <addressLine8>?</addressLine8>
               <!--Optional:-->
               <addressLine9>?</addressLine9>
               <!--Optional:-->
               <building>?</building>
               <!--Optional:-->
               <cebucoCode>?</cebucoCode>
               <!--Optional:-->
               <census>?</census>
               <!--Optional:-->
               <codes>
                  <!--Optional:-->
                  <adaptation>?</adaptation>
                  <!--Optional:-->
                  <detailCode>?</detailCode>
                  <!--Optional:-->
                  <detail_list>?</detail_list>
                  <!--Zero or more repetitions:-->
                  <messages>
                     <!--Optional:-->
                     <code>?</code>
                     <!--Optional:-->
                     <value>?</value>
                  </messages>
                  <!--Optional:-->
                  <options>?</options>
                  <!--Optional:-->
                  <reliability>?</reliability>
               </codes>
               <!--Optional:-->
               <congressionalDistrict>?</congressionalDistrict>
               <!--Optional:-->
               <countryCode>?</countryCode>
               <!--Optional:-->
               <countryISO3>?</countryISO3>
               <!--Optional:-->
               <countryName>?</countryName>
               <!--Optional:-->
               <countryNumber>?</countryNumber>
               <!--Optional:-->
               <county>?</county>
               <!--Optional:-->
               <countyCode>?</countyCode>
               <!--Optional:-->
               <department>?</department>
               <!--Optional:-->
               <district>?</district>
               <!--Optional:-->
               <dpvCoded>?</dpvCoded>
               <!--Optional:-->
               <dpvFootnotes>?</dpvFootnotes>
               <!--Optional:-->
               <dpvIndicator>?</dpvIndicator>
               <!--Optional:-->
               <dpvIsCMRA>?</dpvIsCMRA>
               <!--Optional:-->
               <dpvIsNoStat>?</dpvIsNoStat>
               <!--Optional:-->
               <dpvIsPBSA>?</dpvIsPBSA>
               <!--Optional:-->
               <dpvIsVacant>?</dpvIsVacant>
               <!--Optional:-->
               <eggCode>?</eggCode>
               <!--Optional:-->
               <formalCountryName>?</formalCountryName>
               <!--Optional:-->
               <hausCode>?</hausCode>
               <!--Optional:-->
               <houseNumber>?</houseNumber>
               <!--Optional:-->
               <houseNumberAddition>?</houseNumberAddition>
               <!--Optional:-->
               <lacsIndicator>?</lacsIndicator>
               <!--Optional:-->
               <latitude>?</latitude>
               <!--Optional:-->
               <locality>?</locality>
               <!--Optional:-->
               <longitude>?</longitude>
               <!--Optional:-->
               <lotNumber>?</lotNumber>
               <!--Optional:-->
               <municipalityCode>?</municipalityCode>
               <!--Optional:-->
               <name>?</name>
               <!--Optional:-->
               <organization>?</organization>
               <!--Optional:-->
               <postBox>?</postBox>
               <!--Optional:-->
               <postIndicator>?</postIndicator>
               <!--Optional:-->
               <postTown>?</postTown>
               <!--Optional:-->
               <postalCode>?</postalCode>
               <!--Optional:-->
               <preIndicator>?</preIndicator>
               <!--Optional:-->
               <premise>?</premise>
               <!--Optional:-->
               <province>?</province>
               <!--Optional:-->
               <provinceCode>?</provinceCode>
               <!--Optional:-->
               <subDistrict>?</subDistrict>
               <!--Optional:-->
               <thoroughfare>?</thoroughfare>
               <!--Optional:-->
               <timezone>?</timezone>
               <!--Optional:-->
               <urbanArea>?</urbanArea>
               <!--Optional:-->
               <urbanization>?</urbanization>
            </address>
            <!--Optional:-->
            <credentials>
               <!--Optional:-->
               <username>?</username>
               <!--Optional:-->
               <password>?</password>
               <!--Optional:-->
               <tenant>?</tenant>
            </credentials>
            <!--Optional:-->
            <email>
               <!--Optional:-->
               <addressee>?</addressee>
               <!--Optional:-->
               <codes>
                  <!--Optional:-->
                  <adaptation>?</adaptation>
                  <!--Optional:-->
                  <detailCode>?</detailCode>
                  <!--Optional:-->
                  <detail_list>?</detail_list>
                  <!--Zero or more repetitions:-->
                  <messages>
                     <!--Optional:-->
                     <code>?</code>
                     <!--Optional:-->
                     <value>?</value>
                  </messages>
                  <!--Optional:-->
                  <options>?</options>
                  <!--Optional:-->
                  <reliability>?</reliability>
               </codes>
               <!--Optional:-->
               <countryCode>?</countryCode>
               <!--Optional:-->
               <display_name>?</display_name>
               <!--Optional:-->
               <domain>?</domain>
               <!--Optional:-->
               <full_email_address>?</full_email_address>
               <!--Optional:-->
               <top_level>?</top_level>
            </email>
            <!--Optional:-->
            <identity>
               <!--Optional:-->
               <businessid>?</businessid>
               <!--Optional:-->
               <codes>
                  <!--Optional:-->
                  <adaptation>?</adaptation>
                  <!--Optional:-->
                  <detailCode>?</detailCode>
                  <!--Optional:-->
                  <detail_list>?</detail_list>
                  <!--Zero or more repetitions:-->
                  <messages>
                     <!--Optional:-->
                     <code>?</code>
                     <!--Optional:-->
                     <value>?</value>
                  </messages>
                  <!--Optional:-->
                  <options>?</options>
                  <!--Optional:-->
                  <reliability>?</reliability>
               </codes>
               <!--Optional:-->
               <completename>?</completename>
               <!--Optional:-->
               <contact_type>?</contact_type>
               <!--Optional:-->
               <countryCode>?</countryCode>
               <!--Optional:-->
               <dob>?</dob>
               <!--Optional:-->
               <formofaddress>?</formofaddress>
               <!--Optional:-->
               <function>?</function>
               <!--Optional:-->
               <gender>?</gender>
               <!--Optional:-->
               <givenfullname>?</givenfullname>
               <!--Optional:-->
               <givennameinitials>?</givennameinitials>
               <!--Optional:-->
               <indicator>?</indicator>
               <!--Optional:-->
               <name_qualified>?</name_qualified>
               <!--Optional:-->
               <nationalid>?</nationalid>
               <!--Optional:-->
               <nationality>?</nationality>
               <!--Optional:-->
               <organization_name>?</organization_name>
               <!--Optional:-->
               <passport>?</passport>
               <!--Optional:-->
               <qualification_int_first>?</qualification_int_first>
               <!--Optional:-->
               <qualification_int_second>?</qualification_int_second>
               <!--Optional:-->
               <qualification_suceeding>?</qualification_suceeding>
               <!--Optional:-->
               <qualificationpreceding>?</qualificationpreceding>
               <!--Optional:-->
               <surname_first>?</surname_first>
               <!--Optional:-->
               <surname_prefix_first>?</surname_prefix_first>
               <!--Optional:-->
               <surname_prefix_second>?</surname_prefix_second>
            </identity>
            <!--Optional:-->
            <options>?</options>
            <!--Optional:-->
            <phone>
               <!--Optional:-->
               <area_code>?</area_code>
               <!--Optional:-->
               <calling_code>?</calling_code>
               <!--Optional:-->
               <calling_from>?</calling_from>
               <!--Optional:-->
               <codes>
                  <!--Optional:-->
                  <adaptation>?</adaptation>
                  <!--Optional:-->
                  <detailCode>?</detailCode>
                  <!--Optional:-->
                  <detail_list>?</detail_list>
                  <!--Zero or more repetitions:-->
                  <messages>
                     <!--Optional:-->
                     <code>?</code>
                     <!--Optional:-->
                     <value>?</value>
                  </messages>
                  <!--Optional:-->
                  <options>?</options>
                  <!--Optional:-->
                  <reliability>?</reliability>
               </codes>
               <!--Optional:-->
               <countryCode>?</countryCode>
               <!--Optional:-->
               <formatted_international>?</formatted_international>
               <!--Optional:-->
               <international_prefix>?</international_prefix>
               <!--Optional:-->
               <line_type>?</line_type>
               <!--Optional:-->
               <name>?</name>
               <!--Optional:-->
               <number>?</number>
               <!--Optional:-->
               <phone_number>?</phone_number>
               <!--Optional:-->
               <timezone>?</timezone>
               <!--Optional:-->
               <trunk>?</trunk>
            </phone>
         </input>
      </ws:validate>
   </soapenv:Body>
</soapenv:Envelope>
